tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1907_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1907_H_
#define _PIC16LF1907_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define PORTC                         53
#define RC0                           54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTD                         62
#define RD0                           63
#define RD1                           64
#define RD2                           65
#define RD3                           66
#define RD4                           67
#define RD5                           68
#define RD6                           69
#define RD7                           70
#define PORTE                         71
#define RE0                           72
#define RE1                           73
#define RE2                           74
#define RE3                           75
#define PIR1                          76
#define TMR1IF                        77
#define TXIF                          78
#define RCIF                          79
#define ADIF                          80
#define TMR1GIF                       81
#define PIR2                          82
#define LCDIF                         83
#define TMR0                          84
#define TMR1L                         85
#define TMR1H                         86
#define T1CON                         87
#define TMR1ON                        88
#define nT1SYNC                       89
#define T1OSCEN                       90
#define T1CKPS0                       91
#define T1CKPS                        92
#define T1CKPS1                       93
#define TMR1CS                        94
#define TMR1CS0                       95
#define TMR1CS1                       96
#define T1GCON                        97
#define T1GSS0                        98
#define T1GSS                         99
#define T1GSS1                        100
#define T1GVAL                        101
#define T1GGO_nDONE                   102
#define T1GGO                         103
#define T1GSPM                        104
#define T1GTM                         105
#define T1GPOL                        106
#define TMR1GE                        107
#define TRISA                         108
#define TRISA0                        109
#define TRISA1                        110
#define TRISA2                        111
#define TRISA3                        112
#define TRISA4                        113
#define TRISA5                        114
#define TRISA6                        115
#define TRISA7                        116
#define TRISB                         117
#define TRISB0                        118
#define TRISB1                        119
#define TRISB2                        120
#define TRISB3                        121
#define TRISB4                        122
#define TRISB5                        123
#define TRISB6                        124
#define TRISB7                        125
#define TRISC                         126
#define TRISC0                        127
#define TRISC1                        128
#define TRISC2                        129
#define TRISC3                        130
#define TRISC4                        131
#define TRISC5                        132
#define TRISC6                        133
#define TRISC7                        134
#define TRISD                         135
#define TRISD0                        136
#define TRISD1                        137
#define TRISD2                        138
#define TRISD3                        139
#define TRISD4                        140
#define TRISD5                        141
#define TRISD6                        142
#define TRISD7                        143
#define TRISE                         144
#define TRISE0                        145
#define TRISE1                        146
#define TRISE2                        147
#define PIE1                          148
#define TMR1IE                        149
#define TXIE                          150
#define RCIE                          151
#define ADIE                          152
#define TMR1GIE                       153
#define PIE2                          154
#define LCDIE                         155
#define OPTION_REG                    156
#define PS                            157
#define PS0                           158
#define PS1                           159
#define PS2                           160
#define PSA                           161
#define T0SE                          162
#define TMR0SE                        163
#define T0CS                          164
#define TMR0CS                        165
#define INTEDG                        166
#define nWPUEN                        167
#define PCON                          168
#define nBOR                          169
#define nPOR                          170
#define nRI                           171
#define nRMCLR                        172
#define nRWDT                         173
#define STKUNF                        174
#define STKOVF                        175
#define WDTCON                        176
#define SWDTEN                        177
#define WDTPS                         178
#define WDTPS0                        179
#define WDTPS1                        180
#define WDTPS2                        181
#define WDTPS3                        182
#define WDTPS4                        183
#define OSCCON                        184
#define SCS0                          185
#define SCS                           186
#define SCS1                          187
#define IRCF                          188
#define IRCF0                         189
#define IRCF1                         190
#define IRCF2                         191
#define IRCF3                         192
#define OSCSTAT                       193
#define HFIOFS                        194
#define LFIOFR                        195
#define HFIOFR                        196
#define OSTS                          197
#define T1OSCR                        198
#define ADRESL                        199
#define ADRESH                        200
#define ADCON0                        201
#define ADON                          202
#define nDONE                         203
#define GO_nDONE                      204
#define GO                            205
#define ADGO                          206
#define CHS0                          207
#define CHS                           208
#define CHS1                          209
#define CHS2                          210
#define CHS3                          211
#define CHS4                          212
#define ADCON1                        213
#define ADPREF0                       214
#define ADPREF                        215
#define ADPREF1                       216
#define ADCS0                         217
#define ADCS                          218
#define ADCS1                         219
#define ADCS2                         220
#define ADFM                          221
#define LATA                          222
#define LATA0                         223
#define LATA1                         224
#define LATA2                         225
#define LATA3                         226
#define LATA4                         227
#define LATA5                         228
#define LATA6                         229
#define LATA7                         230
#define LATB                          231
#define LATB0                         232
#define LATB1                         233
#define LATB2                         234
#define LATB3                         235
#define LATB4                         236
#define LATB5                         237
#define LATB6                         238
#define LATB7                         239
#define LATC                          240
#define LATC0                         241
#define LATC1                         242
#define LATC2                         243
#define LATC3                         244
#define LATC4                         245
#define LATC5                         246
#define LATC6                         247
#define LATC7                         248
#define LATD                          249
#define LATD0                         250
#define LATD1                         251
#define LATD2                         252
#define LATD3                         253
#define LATD4                         254
#define LATD5                         255
#define LATD6                         256
#define LATD7                         257
#define LATE                          258
#define LATE0                         259
#define LATE1                         260
#define LATE2                         261
#define BORCON                        262
#define BORRDY                        263
#define BORFS                         264
#define SBOREN                        265
#define FVRCON                        266
#define ADFVR0                        267
#define ADFVR                         268
#define ADFVR1                        269
#define CDAFVR                        270
#define TSRNG                         271
#define TSEN                          272
#define FVRRDY                        273
#define FVREN                         274
#define ANSA0                         275
#define ANSELA                        276
#define ANSA1                         277
#define ANSA2                         278
#define ANSA3                         279
#define ANSA5                         280
#define ANSB0                         281
#define ANSELB                        282
#define ANSB1                         283
#define ANSB2                         284
#define ANSB3                         285
#define ANSB4                         286
#define ANSB5                         287
#define ANSELE                        288
#define ANSE0                         289
#define ANSE1                         290
#define ANSE2                         291
#define PMADRL                        292
#define PMADRH                        293
#define PMDATL                        294
#define PMDATH                        295
#define PMCON1                        296
#define RD                            297
#define WR                            298
#define WREN                          299
#define WRERR                         300
#define FREE                          301
#define LWLO                          302
#define CFGS                          303
#define PMCON2                        304
#define RC1REG                        305
#define TX1REG                        306
#define SP1BRGL                       307
#define BRG0                          308
#define BRG1                          309
#define BRG2                          310
#define BRG3                          311
#define BRG4                          312
#define BRG5                          313
#define BRG6                          314
#define BRG7                          315
#define SP1BRGH                       316
#define BRG8                          317
#define BRG9                          318
#define BRG10                         319
#define BRG11                         320
#define BRG12                         321
#define BRG13                         322
#define BRG14                         323
#define BRG15                         324
#define RC1STA                        325
#define RX9D                          326
#define OERR                          327
#define FERR                          328
#define ADDEN                         329
#define CREN                          330
#define SREN                          331
#define RX9                           332
#define SPEN                          333
#define TX1STA                        334
#define TX9D                          335
#define TRMT                          336
#define BRGH                          337
#define SENDB                         338
#define SYNC                          339
#define TXEN                          340
#define TX9                           341
#define CSRC                          342
#define BAUD1CON                      343
#define ABDEN                         344
#define WUE                           345
#define BRG16                         346
#define SCKP                          347
#define RCIDL                         348
#define ABDOVF                        349
#define WPUB0                         350
#define WPUB                          351
#define WPUB1                         352
#define WPUB2                         353
#define WPUB3                         354
#define WPUB4                         355
#define WPUB5                         356
#define WPUB6                         357
#define WPUB7                         358
#define WPUE                          359
#define WPUE3                         360
#define IOCBP                         361
#define IOCBP0                        362
#define IOCBP1                        363
#define IOCBP2                        364
#define IOCBP3                        365
#define IOCBP4                        366
#define IOCBP5                        367
#define IOCBP6                        368
#define IOCBP7                        369
#define IOCBN0                        370
#define IOCBN                         371
#define IOCBN1                        372
#define IOCBN2                        373
#define IOCBN3                        374
#define IOCBN4                        375
#define IOCBN5                        376
#define IOCBN6                        377
#define IOCBN7                        378
#define IOCBF0                        379
#define IOCBF                         380
#define IOCBF1                        381
#define IOCBF2                        382
#define IOCBF3                        383
#define IOCBF4                        384
#define IOCBF5                        385
#define IOCBF6                        386
#define IOCBF7                        387
#define LCDCON                        388
#define LMUX0                         389
#define LMUX                          390
#define LMUX1                         391
#define CS                            392
#define CS0                           393
#define CS1                           394
#define WERR                          395
#define SLPEN                         396
#define LCDEN                         397
#define LCDPS                         398
#define LP                            399
#define LP0                           400
#define LP1                           401
#define LP2                           402
#define LP3                           403
#define WA                            404
#define LCDA                          405
#define BIASMD                        406
#define WFT                           407
#define LCDREF                        408
#define VLCD1PE                       409
#define VLCD2PE                       410
#define VLCD3PE                       411
#define LCDIRI                        412
#define LCDIRE                        413
#define LCDCST0                       414
#define LCDCST                        415
#define LCDCST1                       416
#define LCDCST2                       417
#define LCDRL                         418
#define LRLAT0                        419
#define LRLAT                         420
#define LRLAT1                        421
#define LRLAT2                        422
#define LRLBP                         423
#define LRLBP0                        424
#define LRLBP1                        425
#define LRLAP0                        426
#define LRLAP                         427
#define LRLAP1                        428
#define LCDSE0                        429
#define SE0                           430
#define SE1                           431
#define SE2                           432
#define SE3                           433
#define SE4                           434
#define SE5                           435
#define SE6                           436
#define SE7                           437
#define LCDSE1                        438
#define SE8                           439
#define SE9                           440
#define SE10                          441
#define SE11                          442
#define SE12                          443
#define SE13                          444
#define SE14                          445
#define SE15                          446
#define LCDSE2                        447
#define SE16                          448
#define SE17                          449
#define SE18                          450
#define SE19                          451
#define SE20                          452
#define SE21                          453
#define SE22                          454
#define SE23                          455
#define LCDSE3                        456
#define SE24                          457
#define SE25                          458
#define SE26                          459
#define SE27                          460
#define SE28                          461
#define LCDDATA0                      462
#define SEG0COM0                      463
#define SEG1COM0                      464
#define SEG2COM0                      465
#define SEG3COM0                      466
#define SEG4COM0                      467
#define SEG5COM0                      468
#define SEG6COM0                      469
#define SEG7COM0                      470
#define LCDDATA1                      471
#define SEG8COM0                      472
#define SEG9COM0                      473
#define SEG10COM0                     474
#define SEG11COM0                     475
#define SEG12COM0                     476
#define SEG13COM0                     477
#define SEG14COM0                     478
#define SEG15COM0                     479
#define LCDDATA2                      480
#define SEG16COM0                     481
#define SEG17COM0                     482
#define SEG18COM0                     483
#define SEG19COM0                     484
#define SEG20COM0                     485
#define SEG21COM0                     486
#define SEG22COM0                     487
#define SEG23COM0                     488
#define LCDDATA3                      489
#define SEG0COM1                      490
#define SEG1COM1                      491
#define SEG2COM1                      492
#define SEG3COM1                      493
#define SEG4COM1                      494
#define SEG5COM1                      495
#define SEG6COM1                      496
#define SEG7COM1                      497
#define LCDDATA4                      498
#define SEG8COM1                      499
#define SEG9COM1                      500
#define SEG10COM1                     501
#define SEG11COM1                     502
#define SEG12COM1                     503
#define SEG13COM1                     504
#define SEG14COM1                     505
#define SEG15COM1                     506
#define LCDDATA5                      507
#define SEG16COM1                     508
#define SEG17COM1                     509
#define SEG18COM1                     510
#define SEG19COM1                     511
#define SEG20COM1                     512
#define SEG21COM1                     513
#define SEG22COM1                     514
#define SEG23COM1                     515
#define LCDDATA6                      516
#define SEG0COM2                      517
#define SEG1COM2                      518
#define SEG2COM2                      519
#define SEG3COM2                      520
#define SEG4COM2                      521
